{"Title":{"0":"Python Fundamentals 1-3","1":"Python Fundamentals 4-6","2":"Python Data Wrangling","3":"Python Data Visualization","4":"Python Web APIs","5":"Python Web Scraping","6":"Python Geospatial Fundamentals","7":"Python Machine Learning Fundamentals","8":"Python Deep Learning","9":"Python Text Analysis","10":"R Fundamentals","11":"R Data Wrangling and Manipulation","12":"R Data Visualization","13":"R Deep Learning","14":"R Machine Learning with tidymodels","15":"R Geospatial Fundamentals","16":"QGIS Geospatial Fundamentals","17":"Stata Fundamentals","18":"Bash + Git: Introduction","19":"Excel Data Analysis: Introduction","20":"Excel Data Analysis: Charts, Pivot Tables, and VLOOKUP","21":"Institutional Review Board (IRB) Fundamentals","22":"MaxQDA: Introduction","23":"Qualtrics Fundamentals"},"Description":{"0":"This three-part interactive workshop series is your complete introduction to programming Python for people with little or no previous programming experience. By the end of the series, you will be able to apply your knowledge of basic principles of programming and data manipulation to a real-world social science application.","1":"This three-part interactive workshop series forms the second part of Python Fundamentals. It is intended for people who want to learn about core structures of Python that underpin data analysis. We cover loops and conditionals, creating your own functions, analysis and visualization in Pandas, and the workflow of a data science project.","2":"This workshop provides an introduction to data wrangling and manipulation in\nPython. Our main focus is manipulating data frames, the most common data\nstructure for representing tabular data. ","3":"This workshop provides an introduction to visualization with Python. We will cover visualization principles and plotting with Matplotlib and Seaborn, working through examples in a Jupyter notebook and documentation of each plotting package. We’ll also learn about styles and customizing plots. Throughout the workshop, we’ll discuss the plot types best suited for particular kinds of data.\n\nThe following plot types will be covered:\n\n* Histogram\n* Barplot\n* Boxplot\n* Scatterplot\n* Lineplot\n* Subplot","4":"This workshop covers how to extract data from the web with APIs using Python. APIs are often official services offered by companies and other entities, which allow you to directly query their servers in order to retrieve their data. ","5":"This workshop covers how to scrape data from the web using Python. Web scraping involves downloading a webpage's source code and sifting through the material to extract desired data, and is typically only done when Web APIs are not available..\n","6":"Geospatial data are an important component of data visualization and analysis in the social sciences, humanities, and elsewhere. The Python programming language is a great platform for exploring these data and integrating them into your research.\n\n","7":"This workshop introduces students to scikit-learn, the popular machine learning library in Python, as well as the auto-ML library built on top of scikit-learn, TPOT. The focus will be on scikit-learn syntax and available tools to apply machine learning algorithms to datasets. No theory instruction will be provided. ","8":"The goal of this workshop is to build intuition for deep learning by building, training, and testing models in Python using Keras. Rather than a theory-centered approach, we will evaluate deep learning models through empirical results. We will explore different architectures of neural networks as well as their drawbacks and avantages.","9":"This 3-part workshop will prepare participants to move forward with research that uses text analysis, with a special focus on social science applications. We explore fundamental approaches to applying computational methods to text in Python. We cover some of the major packages used in natural language processing, including scikit-learn, NLTK, spaCy, and Gensim.","10":"This workshop is a four-part introductory series that will teach you R from scratch with clear introductions, concise examples, and support documents. You will learn how to download and install the open-sourced R Studio software, understand data and basic manipulations, import and subset data, explore and visualize data, and understand the basics of automation in the form of loops and functions. After completion of this workshop you will have a foundational understanding to create, organize, and utilize workflows for your personal research.","11":"This workshop will introduce packages in R (notably dplyr and tidyr) that make data wrangling and manipulation much easier.","12":"This workshop will provide an introduction to graphics in R with ggplot2. Participants will learn how to construct, customize, and export a variety of plot types in order to visualize relationships in data. We will also explore the basic grammar of graphics, including the aesthetics and geometry layers, adding statistics, transforming scales, and coloring or panelling by groups. You will learn how to make histograms, boxplots, scatterplots, lineplots, and heatmaps as well as how to make compound figures.","13":"This workshop introduces Deep Learning — the training and performance evaluation of large neural networks, especially for image classification, natural language processing, and time-series data. We will use Keras to explore deep learning algorithms, mapping input data to their appropriately classified outcome labels. ","14":"In this workshop, we provide an introduction to machine learning algorithms by making use of the tidymodels package. First, we discuss what machine learning is, what problems it works well for, and what problems it might work less well for. Then, we'll explore the tidymodels framework to learn how to fit machine learning models in R. Finally, we will apply the tidymodels framework to explore multiple machine learning algorithms in R.\n","15":"Geospatial data are an important component of data visualization and analysis in the social sciences, humanities, and elsewhere. The R programming language is a great platform for exploring these data and integrating them into your research. This workshop focuses on fundamental operations for reading, writing, manipulating and mapping vector data, which encodes location as points, lines and polygons.","16":"This workshop provides an introduction to working with geospatial data in QGIS, a free and open source desktop GIS software package.\n","17":"This workshop is a three-part introductory series that will teach you Stata from scratch with clear introductions, concise examples, and support documents. You will learn how to download and install the Stata software, understand data and basic manipulations, import and subset data, explore and visualize data, and understand the basics of automation in the form of loops and functions. After completion of this workshop you will have a foundational understanding to create, organize, and utilize workflows for your personal research.\n\nEach of the parts is divided into a lecture-style coding walkthrough interrupted by challenge problems, discussions of the solutions, and breaks. Instructors and TAs are dedicated to engaging you in the classroom and answering questions in plain language. \n\nPart 1:  Introduction\n • Loading datasets into Stata (no previous knowledge expected)\n • Examining a dataset and finding variables of interest\n • Summarizing and tabulating variables\n • Stata specific tools and resources (do files, logs, help files, etc.)\n • Coding and cleaning data (making new variables from variables; labeling variables and values, etc.)\n • Using logical operators in Stata\n • Cross-tabulations\n\nPart 2: Data Analysis in Stata \n • Correlation\n • T-tests\n • Ordinary Least Squares (OLS) and logistic regression (basic syntax, using interaction terms, interpreting output)\n • Visualization (histograms, bar graphs, scatter plots)\n • Regression postestimation (getting predicted values, basic graphs)\n • Merging and appending datasets\n\nPart 3: Stata Programming\n • Local and global variables (macros)\n • Looping (foreach, forvalues)\n • Reshaping data between wide and long formats\n • Recalling and using command output\n • Generating nicely formatted journal-style tables","18":"This workshop will start by introducing you to navigating your computer’s file system and basic Bash commands to remove the fear of working with the command line and to give you the confidence to use it to increase your productivity. And then working with Git, a powerful tool for keeping track of changes you make to the files in a project.\n\nYou will learn to use Bash and Git together to synchronize your work across computers, collaborate with others, and even deploy applications to the cloud. In this workshop, you will learn the basics to understand and use Git, including working with the popular \"social coding\" website, GitHub where you can keep a private backup copy of your code or choose to publish it to the world. ","19":"This is a three-hour introductory workshop that will provide an overview of Excel, with no prior experience assumed. Attendees will learn how to use functions for handling data and making calculations, how to build charts and pivot tables, and more.\n\nThe workshop includes a lecture-style walkthrough of each concept, combined with challenge problems to apply each concept to a real-world data analysis application. Instructors and TAs will provide support for students using Excel on either Windows or Mac, as well as for students using Google Sheets.","20":"This three-hour workshop will cover charts in more detail, review pivot tables, and work through at least one further challenge problem for functions. As a bonus, we'll also introduce the widely-used VLOOKUP function.","21":"Are you starting a research project at UC Berkeley that involves human subjects? If so, one of the first steps you will need to take is getting IRB approval. Numerous questions can come to mind when first negotiating getting a project approved. When should you apply? Does your project require review, and if so, what kind? This course will walk you through the process of getting IRB approval for your project. After this course, you will approach getting your project approved with confidence that will save you time and avoid potential delays.\n\nSpecifically, we will:\n\nDescribe the origins of the institutional review board and its purpose.\n• Introduce you to IRB at UC Berkeley.\n• Walk through the different types of protocols to determine the best one for your project.\n• Create a protocol and explain in-depth the different portions that make up your eprotocol.\n• Discuss the review and amendment process.","22":"This two-hour introductory workshop will teach you MaxQDA from scratch with clear introductions, concise examples, and support documents. You will learn how to download and install the MaxQDA software, upload multiple forms of data then how to use manual and autocode features. We will review some of the additional analytic features including visual, memo and the Questions, Themes and Theories (QTT) tools. We will briefly touch on the MaxQDA Team cloud-based version. Instructors will share recommended resources.","23":"Qualtrics is a powerful online tool available to Berkeley community members that can be used for a range of data collection activities.  Primarily, Qualtrics is designed to make web surveys easy to write, test, and implement, but the software can be used for data entry, training, quality control, evaluation, market research, pre\/post-event feedback, and other uses with some creativity.\n\nThis overview will introduce a simple workflow using the system with an orientation to the main interfaces for web survey design, sample management, corresponding with sample members, and exporting data at the end of the field period.  Examples from completed surveys in public health, economics, program evaluation, and other disciplines will be incorporated in the overview.\n\nThis workshop will introduce students to the basics of designing a survey instrument using the Qualtrics platform, such as randomization and survey flow. We will also cover more advanced topics like implementing embedded data and using javascript, as well as tips and tricks on how to use your design to maximize the number of quality responses you get."},"Prerequisites":{"0":null,"1":"Python Fundamentals 1-3","2":"Python Fundamentals 1-3","3":"Python Fundamentals 1-3","4":"Python Fundamentals 1-3, Python Fundamentals 4-6","5":"Python Fundamentals 1-3, Python Fundamentals 4-6","6":"Python Fundamentals 1-3, Python Fundamentals 4-6, Python Data Wrangling","7":"Python Fundamentals 1-3, Python Fundamentals 4-6, Python Data Wrangling","8":"Python Fundamentals 1-3, Python Fundamentals 4-6, Python Data Wrangling, Python Machine Learning Fundamentals","9":"Python Fundamentals 1-3, Python Fundamentals 4-6, Python Data Wrangling","10":"Python Fundamentals 1-3, Python Fundamentals 4-6, Python Data Wrangling, Python Text Analysis Fundamentals","11":"Python Fundamentals 1-3, Python Fundamentals 4-6, Python Data Wrangling, Python Text Analysis Fundamentals","12":null,"13":"R Fundamentals","14":"R Fundamentals","15":"R Fundamentals, R Data Wrangling and Manipulation, R Machine Learning with tidymodels","16":"R Fundamentals, R Data Wrangling and Manipulation","17":"R Fundamentals, R Data Wrangling and Manipulation","18":null,"19":null,"20":null,"21":null,"22":"Excel Data Analysis: Introduction","23":null,"24":null,"25":null},"Workshop Materials":{"0":"https:\/\/github.com\/dlab-berkeley\/Python-Fundamentals","1":"https:\/\/github.com\/dlab-berkeley\/Python-Intermediate","2":"https:\/\/github.com\/dlab-berkeley\/Python-Data-Wrangling","3":"https:\/\/github.com\/dlab-berkeley\/Python-Data-Visualization-Pilot","4":"https:\/\/github.com\/dlab-berkeley\/Python-Web-APIs","5":"https:\/\/github.com\/dlab-berkeley\/Python-Web-Scraping","6":"https:\/\/github.com\/dlab-berkeley\/Python-Geospatial-Fundamentals","7":"https:\/\/github.com\/dlab-berkeley\/Python-Machine-Learning-Fundamentals","8":"https:\/\/github.com\/dlab-berkeley\/Python-Deep-Learning","9":"https:\/\/github.com\/dlab-berkeley\/Python-Text-Analysis","10":"https:\/\/github.com\/dlab-berkeley\/Python-Text-Analysis","11":"https:\/\/github.com\/dlab-berkeley\/Python-Text-Analysis","12":"https:\/\/github.com\/dlab-berkeley\/R-Fundamentals","13":"https:\/\/github.com\/dlab-berkeley\/R-Data-Wrangling","14":"https:\/\/github.com\/dlab-berkeley\/R-Data-Visualization","15":"https:\/\/github.com\/dlab-berkeley\/R-Deep-Learning","16":"https:\/\/github.com\/dlab-berkeley\/R-Machine-Learning","17":"https:\/\/github.com\/dlab-berkeley\/R-geospatial-fundamentals","18":"https:\/\/github.com\/dlab-berkeley\/Geospatial-Fundamentals-in-QGIS","19":"https:\/\/github.com\/dlab-berkeley\/stata-fundamentals","20":"https:\/\/github.com\/dlab-berkeley\/Bash-Git","21":"https:\/\/github.com\/dlab-berkeley\/Excel-Fundamentals","22":"https:\/\/github.com\/dlab-berkeley\/Excel-Fundamentals","23":"https:\/\/github.com\/dlab-berkeley\/IRB-Fundamentals","24":"https:\/\/github.com\/dlab-berkeley\/MAXQDA-Fundamentals","25":"https:\/\/github.com\/dlab-berkeley\/Qualtrics-Fundamentals"}}